IDEA StatiCa Open Model
SectionCharacteristics.Rgz Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets the radius of gyration related to the axis Z. Also known as iz.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Rgz { get; set; }
Public Property Rgz As Double
	Get
	Set
public:
property double Rgz {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
SectionCharacteristics Class
IdeaRS.OpenModel.Geometry2D Namespace